############################################################
#
# 編集画面に Layoutテンプレート・ヘルプへのリンクを表示する
#
############################################################
package plugin::layout::EditHelper;
use strict;
use warnings;
#===========================================================
# コンストラクタ
#===========================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#===========================================================
# ヘルプを表示します。
#===========================================================
sub editform {
	my $self = shift;
	my $wiki = shift;
	my $html = "";
	
	$html .= "<h2>レイアウト・テンプレート</h2>";
	$html .= "";
	
	$html .= "<div>[<a href=\"".$wiki->create_url({action=>'LAYOUTHELP'})."\" target=\"_blank\">レイアウト・テンプレート・ヘルプ</a>]</div>";
	
	return $html;
}

1;
