################################################################################
#
# <p>章の見出しを出力するパラグラフプラグイン。</p>
# <pre>
# {{chapter 1,はじめに}}
# </pre>
# <p>
#   他のプラグインではこのプラグインで定義した章番号を使って図表番号などを振って
#   いるため、1ページに最低1つはこのプラグインを記述しておく必要があります。
# </p>
#
################################################################################
package plugin::book::Chapter;
use strict;
use warnings;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#==============================================================================
# パラグラフメソッド
#==============================================================================
sub paragraph {
	my $self    = shift;
	my $wiki    = shift;
	my $chapter = shift;
	my $title   = shift;
	
	$self->{'chapter'} = $chapter;
	$wiki->do_hook('chapter');
	
	return '<div class="chapter"><a name="chapter"'.$chapter.'>Chapter '.$chapter.'. '.Util::escapeHTML($title).'</a></div>';
}

1;
