################################################################################
#
# <p>ページから削除する部分を示すためのインラインプラグインです。</p>
# <pre>
# {{del ここに削除する内容を記述します。}}
# </pre>
# <p>
#   削除する内容は青地 + 取り消し線で表示されます。
#   また、memolistプラグインを使用して一覧表示することができます。
# </p>
#
################################################################################
package plugin::book::Del;
use strict;
use warnings;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	$self->{'todo'} = [];
	return bless $self,$class;
}

#==============================================================================
# パラグラフメソッド
#==============================================================================
sub inline {
	my $self = shift;
	my $wiki = shift;
	my $text = shift;
	
	my $plugin = $wiki->get_plugin_instance('plugin::book::Memo');
	push(@{$plugin->{'memolist'}}, "[delete]".$text);
	my @list = @{$plugin->{'memolist'}};
	
	return '<span class="delete"><a name="todo-'.($#list + 1).'"></a>'.Util::escapeHTML($text).'</span>';
}

1;
