###############################################################################
#
# <p>ノートを記述するためのブロックプラグインです。</p>
# <pre>
# {{note
# ノート本文
# }}
# </pre>
# <p>コラム本文はWiki形式で記述することができます。</p>
#
###############################################################################
package plugin::book::Note;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#==============================================================================
# ブロックメソッド
#==============================================================================
sub block {
	my $self    = shift;
	my $wiki    = shift;
	my $content = shift;
	my $title   = shift;
	
	return '<div class="note"><div class="note-title">Note: '.Util::escapeHTML($title).'</div>'.
		'<div class="note-body">'.$wiki->process_wiki($content).'</div></div>';
}

1;
