################################################################################
#
# <p>章の中を複数のセクション区切るためのパラグラフプラグイン。</p>
# <pre>
# {{section 文字列処理}}
# ...
# {{section 正規表現}}
# ...
# </pre>
# <p>
#   このプラグインはページ上には何も出力しませんが、tocプラグインで見出しの
#   アウトライン表示を行う際に記述した位置にセクション区切りが挿入されます。
# </p>
#
################################################################################
package plugin::book::Section;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#==============================================================================
# パラグラフメソッド
#==============================================================================
sub paragraph {
	my $self  = shift;
	my $wiki  = shift;
	my $title = shift;
	
	return ''
}

1;
