################################################################################
#
# <p>見出し1に付与することで見出し番号を付与するインラインプラグインです。</p>
# <pre>
# !!!{{title1}}見出し1
# </pre>
#
################################################################################
package plugin::book::Title1;
use strict;
use warnings;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#==============================================================================
# インラインメソッド
#==============================================================================
sub inline {
	my $self   = shift;
	my $wiki   = shift;
	my $anchor = shift;
	
	my $chapter = $wiki->get_plugin_instance('plugin::book::Chapter');
	$self->{'count'}++;
	
	if($anchor eq ''){
		return $chapter->{'chapter'}.'-'.$self->{'count'}.'. ';
	} else {
		return '<a name="'.Util::escapeHTML($anchor).'">'.$chapter->{'chapter'}.'-'.$self->{'count'}.'. </a>';
	}
}

#==============================================================================
# フックメソッド
#==============================================================================
sub hook {
	my $self = shift;
	$self->{'count'} = 0;
}

1;
